import { Product } from '../model/product.model';

// Супы
export const soups = [
	new Product(1,
		'Сырный суп',
		[8],
		'Суп-пюре на основе сыра – сама нежность. Куриное филе отличное дополнение к сливочному вкусу. Приправлен шампанским. Подается с сухариками',
		100,
		0,
		'/images/soups/sirniy_sup.jpg'
	),
	new Product(2,
		'Борщ по-сибирски',
		[8],
		'Этот борщ позволит почувствовать себя как дома! Оцените оригинальную подачу с шашлычком из курицы, хлебом, грудинкой, сметаной и горчицей',
		100,
		0,
		'/images/soups/borshch-po-sibirski.jpg'
	),
	new Product(3,
		'Сухарики',
		[8],
		'Сухарики',
		100,
		0),
	new Product(4,
		'Тайский суп Том Ям',
		[8],
		'Ностальгия по отпуску, проведенному в Азии? Острый тайский суп на курином бульоне с овощами позволит вернуться в жаркие дни у моря',
		100,
		0
	),
	new Product(5,
		'Норвежский суп',
		[8],
		'Насыщенный сливочным вкусом овощной суп с семгой',
		100,
		0
	),
	new Product(6,
		'Сырный суп (no alcohol)',
		[8],
		'Суп-пюре на основе сыра – сама нежность. Куриное филе отличное дополнение к сливочному вкусу. Подается с сухариками. Теперь и без добавления шампанского',
		100,
		0),
	new Product(7,
		'Окрошка классическая',
		[8],
		'Окрошка с ветчиной. Подаётся с  хреном, горчицей и сметаной.',
		100,
		0
	),
	new Product(8,
		'Окрошка с говядиной',
		[8],
		'Окрошка с говядиной. Подаётся с хреном, горчицей и сметаной',
		100,
		0
	),
	new Product(9,
		'Солянка',
		[8],
		'Густая и сытная, по традиционному рецепту русcкой кухни, сдобренная сметаной – прекрасное начало обеда для тех, кто хорошо потрудился с утра',
		100,
		0
	),
	new Product(10,
		'Суп Летний',
		[8],
		'Ароматный супчик, с кусочками курицы, расцвеченный крупно нарезанной морковкой',
		100,
		0
	),
	new Product(11,
		'Французский луковый суп',
		[8],
		'Густой, ароматный, вкусный бульон с луком, сливками, сыром, корицей и специями. Дополняет блюдо хрустящий багет',
		100,
		0
	),
];

export const salads = [
	new Product(
		12,
		'Салат Греческий',
		[7],
		'Свежие овощи: томаты, огурцы, болгарский перец, листья салатов, с лоснящимися черными маслинами, красным луком и соусами Крем Чиз и Греческим',
		179,
		0),
	new Product(
		13,
		'Салат Греческий с курицей',
		[7],
		'Сочетание классического рецепта салата Греческий с нежным куриным филе, приготовленном на гриле',
		209,
		0
	),
	new Product(
		14,
		'Салат Греческий с ростбифом',
		[7],
		'Оригинальное сочетание классического рецепта салата Греческий с ростбифом',
		279,
		0
	),
	new Product(
		15,
		'Салат киноа по-гречески',
		[7],
		'Идеальное сочетание куриного филе с киноа, листьями салата и свежими томатами',
		149,
		0
	),
	new Product(
		16,
		'Салат Цезарь с цыпленком',
		[7],
		'Микс салата, соус Цезарь, сыр, яйцо перепелиное, томаты свежие, сухарики пшеничные, филе куриное',
		279,
		0
	),
	new Product(
		17,
		'Поке с семгой',
		[7, 18],
		'Филе семги в специальном соусе, маринованный имбирь, консервированная кукуруза, огурцы свежие, консервированные  ананасы, салат  Чука, кунжут, водоросли Нори, соус кунжутный, соус соевый, орех кешью, сыр, гарнир на выбор',
		329,
		0
	),
];


